tutorial-src/tutorial/sub-hexadecimal.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-11 Wed 21:26 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Hexadecimal Numbers</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Howard Abrams" />

   <link href='http://fonts.googleapis.com/css?family=Source+Sans+Pro:400,700,400italic,700italic&subset=latin,latin-ext' rel='stylesheet' type='text/css'>
   <link href='http://fonts.googleapis.com/css?family=Source+Code+Pro:400,700' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">Hexadecimal Numbers</h1>
<p>
Computers like numbers in base 2 &#x2026; or binary. But typing the number
27 in binary is: <code>11011</code> &#x2026; quite tedious. However, <b>decimal notation</b>
(a number system with ten symbols that we use all the time), isn’t
good for computers since ten isn't based on two.
</p>

<p>
We need a number system for both computers and people. This is why you
may run across <b>hexadecimal</b> which uses <i>sixteen</i> symbols:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Number</th>
<th scope="col" class="org-left">Sixteen</th>
<th scope="col" class="org-left">Ones</th>
<th scope="col" class="org-left">Number</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Zero</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>0</code></td>
<td class="org-left"><code>0</code></td>
</tr>

<tr>
<td class="org-left">One</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>1</code></td>
<td class="org-left"><code>1</code></td>
</tr>

<tr>
<td class="org-left">Two</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>2</code></td>
<td class="org-left"><code>2</code></td>
</tr>

<tr>
<td class="org-left">Three</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>3</code></td>
<td class="org-left"><code>3</code></td>
</tr>

<tr>
<td class="org-left">Four</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>4</code></td>
<td class="org-left"><code>4</code></td>
</tr>

<tr>
<td class="org-left">Five</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>5</code></td>
<td class="org-left"><code>5</code></td>
</tr>

<tr>
<td class="org-left">Six</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>6</code></td>
<td class="org-left"><code>6</code></td>
</tr>

<tr>
<td class="org-left">Seven</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>7</code></td>
<td class="org-left"><code>7</code></td>
</tr>

<tr>
<td class="org-left">Eight</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>8</code></td>
<td class="org-left"><code>8</code></td>
</tr>

<tr>
<td class="org-left">Nine</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>9</code></td>
<td class="org-left"><code>9</code></td>
</tr>

<tr>
<td class="org-left">Ten</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>A</code></td>
<td class="org-left"><code>A</code></td>
</tr>

<tr>
<td class="org-left">Eleven</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>B</code></td>
<td class="org-left"><code>B</code></td>
</tr>

<tr>
<td class="org-left">Twelve</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>C</code></td>
<td class="org-left"><code>C</code></td>
</tr>

<tr>
<td class="org-left">Thirteen</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>D</code></td>
<td class="org-left"><code>D</code></td>
</tr>

<tr>
<td class="org-left">Fourteen</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>E</code></td>
<td class="org-left"><code>E</code></td>
</tr>

<tr>
<td class="org-left">Fifteen</td>
<td class="org-left">&#xa0;</td>
<td class="org-left"><code>F</code></td>
<td class="org-left"><code>F</code></td>
</tr>

<tr>
<td class="org-left">Sixteen</td>
<td class="org-left"><code>1</code></td>
<td class="org-left"><code>0</code></td>
<td class="org-left"><code>10</code></td>
</tr>

<tr>
<td class="org-left">Seventeen</td>
<td class="org-left"><code>1</code></td>
<td class="org-left"><code>1</code></td>
<td class="org-left"><code>11</code></td>
</tr>

<tr>
<td class="org-left">Eighteen</td>
<td class="org-left"><code>1</code></td>
<td class="org-left"><code>2</code></td>
<td class="org-left"><code>12</code></td>
</tr>

<tr>
<td class="org-left">Nineteen</td>
<td class="org-left"><code>1</code></td>
<td class="org-left"><code>3</code></td>
<td class="org-left"><code>13</code></td>
</tr>

<tr>
<td class="org-left">Twenty</td>
<td class="org-left"><code>1</code></td>
<td class="org-left"><code>4</code></td>
<td class="org-left"><code>14</code></td>
</tr>

<tr>
<td class="org-left">Hundred</td>
<td class="org-left"><code>6</code></td>
<td class="org-left"><code>4</code></td>
<td class="org-left"><code>64</code></td>
</tr>

<tr>
<td class="org-left">Two Hundred</td>
<td class="org-left"><code>C</code></td>
<td class="org-left"><code>8</code></td>
<td class="org-left"><code>C8</code></td>
</tr>

<tr>
<td class="org-left">Two Hundred and Fifty-five</td>
<td class="org-left"><code>F</code></td>
<td class="org-left"><code>F</code></td>
<td class="org-left"><code>FF</code></td>
</tr>
</tbody>
</table>

<p>
<i>One Hundred</i> is <code>64</code> because six ✕ sixteen is ninety-six plus four is one hundred.
</p>

<p>
Two hundred is <code>C8</code> because <code>C</code> is <i>twelve</i> and twelve ✕ sixteen is
one-hundred and ninety-two (just add eight more to get two-hundred).
</p>
</div>
</body>
</html>
